; domain
(define (domain joint_teleport-assistance7_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    enabled disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_can_be_activated)
    (is-goal ?p -  place)
    (free ?p -  place)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (teleport_can_be_activated)
        (at-teleport ?pos1 disabled)
        (is-goal ?pos2)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos1 enabled)
        (not (teleport_can_be_activated))
        (not (at-teleport ?pos1 disabled))
        (not (free ?pos2))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 enabled)
        (is-goal ?pos2)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (free ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance7_problem_29)
(:domain joint_teleport-assistance7_domain)
(:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos1-0 pos1-1 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos3-0 pos3-1 pos3-2 pos4-1 pos4-3 pos4-4 pos5-1 pos5-3 pos6-0 pos6-1 pos6-2 pos6-4 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (free pos0-0)
    (free pos0-1)
    (free pos0-2)
    (free pos0-3)
    (free pos1-0)
    (free pos1-1)
    (free pos1-3)
    (free pos1-4)
    (free pos2-0)
    (free pos2-1)
    (free pos2-2)
    (free pos2-3)
    (free pos2-4)
    (free pos3-0)
    (free pos3-1)
    (free pos3-2)
    (free pos4-1)
    (free pos4-3)
    (free pos4-4)
    (free pos5-1)
    (free pos5-3)
    (free pos6-0)
    (free pos6-1)
    (free pos6-2)
    (free pos6-4)
    (at-teleport pos3-1 disabled)
    (at-teleport pos6-2 disabled)
    (at-teleport pos0-1 disabled)
    (at-teleport pos0-3 disabled)
    (at-teleport pos6-0 disabled)
    (teleport_can_be_activated)
    (is-goal pos2-1)
    (at-prime pos0-1)
    (adj-walk pos0-0 pos0-1)
    (adj-walk pos0-1 pos0-0)
    (adj-walk pos0-0 pos1-0)
    (adj-walk pos1-0 pos0-0)
    (adj-walk pos0-1 pos0-2)
    (adj-walk pos0-2 pos0-1)
    (adj-walk pos0-1 pos1-1)
    (adj-walk pos1-1 pos0-1)
    (adj-walk pos0-2 pos0-3)
    (adj-walk pos0-3 pos0-2)
    (adj-walk pos0-3 pos1-3)
    (adj-walk pos1-3 pos0-3)
    (adj-walk pos1-0 pos1-1)
    (adj-walk pos1-1 pos1-0)
    (adj-walk pos1-0 pos2-0)
    (adj-walk pos2-0 pos1-0)
    (adj-walk pos1-1 pos2-1)
    (adj-walk pos2-1 pos1-1)
    (adj-walk pos1-3 pos1-4)
    (adj-walk pos1-4 pos1-3)
    (adj-walk pos1-3 pos2-3)
    (adj-walk pos2-3 pos1-3)
    (adj-walk pos1-4 pos2-4)
    (adj-walk pos2-4 pos1-4)
    (adj-walk pos2-0 pos2-1)
    (adj-walk pos2-1 pos2-0)
    (adj-walk pos2-0 pos3-0)
    (adj-walk pos3-0 pos2-0)
    (adj-walk pos2-1 pos2-2)
    (adj-walk pos2-2 pos2-1)
    (adj-walk pos2-1 pos3-1)
    (adj-walk pos3-1 pos2-1)
    (adj-walk pos2-2 pos2-3)
    (adj-walk pos2-3 pos2-2)
    (adj-walk pos2-2 pos3-2)
    (adj-walk pos3-2 pos2-2)
    (adj-walk pos2-3 pos2-4)
    (adj-walk pos2-4 pos2-3)
    (adj-walk pos3-0 pos3-1)
    (adj-walk pos3-1 pos3-0)
    (adj-walk pos3-1 pos3-2)
    (adj-walk pos3-2 pos3-1)
    (adj-walk pos3-1 pos4-1)
    (adj-walk pos4-1 pos3-1)
    (adj-walk pos4-1 pos5-1)
    (adj-walk pos5-1 pos4-1)
    (adj-walk pos4-3 pos4-4)
    (adj-walk pos4-4 pos4-3)
    (adj-walk pos4-3 pos5-3)
    (adj-walk pos5-3 pos4-3)
    (adj-walk pos5-1 pos6-1)
    (adj-walk pos6-1 pos5-1)
    (adj-walk pos6-0 pos6-1)
    (adj-walk pos6-1 pos6-0)
    (adj-walk pos6-1 pos6-2)
    (adj-walk pos6-2 pos6-1)
)

(:goal
  (and
    (at-prime pos2-1)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
2. (pri_walk pos0-1 pos1-1)
   deleted: (prime_turn) (at-prime pos0-1)
   added: (supporter_turn) (at-prime pos1-1)
   goals met: 0 of 1
3. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
4. (pri_walk pos1-1 pos2-1)
   deleted: (prime_turn) (at-prime pos1-1)
   added: (supporter_turn) (at-prime pos2-1)
   goals met: 1 of 1
